day2/SandwichrSamy/app/controllers/ingredients_controller.rb

INSERT INTO "ingredients" ("name", "calories", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "mayonaise"], ["calories", 0], ["created_at", "2016-05-02 16:48:36.314682"], ["updated_at", "2016-05-02 16:48:36.314682"]]
---
    def create
        ingredient = Ingredient.create(ingredient_params)

DELETE FROM "ingredients" WHERE "ingredients"."id" = ?  [["id", 2]]
---
    def destroy
        ingredient = load_ingredient(params[:id])

        ingredient.destroy

SELECT  "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = ? LIMIT 1  [["id", 2]]
---
    def load_ingredient(id)
        ingredient = Ingredient.find_by(id: id)