day2/SandwichrSamy/app/controllers/sandwiches_controller.rb

SELECT  "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = ? LIMIT 1  [["id", 3]]
SELECT  1 AS one FROM "ingredients" INNER JOIN "sandwich_ingredients" ON "ingredients"."id" = "sandwich_ingredients"."ingredient_id" WHERE "sandwich_ingredients"."sandwich_id" = ? AND "ingredients"."id" = ? LIMIT 1  [["sandwich_id", 2], ["id", 2]]
SELECT "ingredients".* FROM "ingredients" INNER JOIN "sandwich_ingredients" ON "ingredients"."id" = "sandwich_ingredients"."ingredient_id" WHERE "sandwich_ingredients"."sandwich_id" = ?  [["sandwich_id", 2]]
UPDATE "sandwiches" SET "total_calories" = ?, "updated_at" = ? WHERE "sandwiches"."id" = ?  [["total_calories", 50], ["updated_at", "2016-05-02 20:07:46.744826"], ["id", 1]]
INSERT INTO "sandwich_ingredients" ("sandwich_id", "ingredient_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["sandwich_id", 3], ["ingredient_id", 3], ["created_at", "2016-05-02 19:47:49.655611"], ["updated_at", "2016-05-02 19:47:49.655611"]]
---
    def add_ingredient
        sandwich = load_sandwich(params[:id])
        if sandwich.nil?
            return
        end
        ingredient = Ingredient.find(params[:ingredient_id])
        if ingredient.nil?
            render json: {error: "ingredient not found"}, status: 404
            return
        end

        unless sandwich.ingredients.include? ingredient #is this correct?
            new_calories = sandwich.total_calories + ingredient.calories
            sandwich.update(total_calories: new_calories)
            sandwich.ingredients.push ingredient

SELECT "sandwiches".* FROM "sandwiches"
---
    def index
        sandwiches = Sandwich.all

INSERT INTO "sandwiches" ("name", "bread_type", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Club"], ["bread_type", "rye"], ["created_at", "2016-05-02 17:34:36.569873"], ["updated_at", "2016-05-02 17:34:36.569873"]]
---
    def create
        sandwich = Sandwich.create(sandwich_params)

DELETE FROM "sandwiches" WHERE "sandwiches"."id" = ?  [["id", 1]]
---
    def destroy
        sandwich = load_sandwich(params[:id])
        if sandwich.nil?
            return
        end

        sandwich.destroy

SELECT  "sandwiches".* FROM "sandwiches" WHERE "sandwiches"."id" = ? LIMIT 1  [["id", 3]]
---
    def load_sandwich(id)
        sandwich = Sandwich.find_by(id: id)