day2/SandwichrSamy/app/controllers/sandwich_views_controller.rb

SELECT "sandwiches".* FROM "sandwiches"
---
    def index
        @sandwiches = Sandwich.all

SELECT  "sandwiches".* FROM "sandwiches" WHERE "sandwiches"."id" = ? LIMIT 1  [["id", 2]]
SELECT "ingredients".* FROM "ingredients"
---
    def show
        @sandwich = Sandwich.find(params[:id])
        @ingredients = @sandwich.ingredients
        @possible_ingredients = Ingredient.all